In [6]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Series

* It is a one-dimensional array-like object containing a sequence of values
* It also contains an associated array of data labels, called its index

### Defining a series from an array (with default index)

In [7]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

### Accessing values in the series in form of an array

In [8]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

### Accessing index of a series

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

### Defining a series from an array (with default index)

In [64]:
obj2 = pd.Series([4.4, np.NaN, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2

d    4.4
b    NaN
a   -5.3
c    3.6
dtype: float64

In [65]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

### Using labels in the index to select values

In [66]:
obj2[['c', 'a', 'd']]

c    3.6
a   -5.3
d    4.4
dtype: float64

### Using index (number) to select data

In [68]:
obj2.index[2:]

Index(['a', 'c'], dtype='object')

In [67]:
obj2[obj2.index[2:]]

a   -5.3
c    3.6
dtype: float64

### Altering index

In [69]:
obj2.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

### Using filtering with a boolean array, scalar multiplication, or math functions to select values

In [14]:
obj2[obj2 > 0]

Bob     4.4
Ryan    3.6
dtype: float64

In [15]:
obj2 * 2

Bob       8.8
Steve     NaN
Jeff    -10.6
Ryan      7.2
dtype: float64

In [16]:
np.round(obj2)

Bob      4.0
Steve    NaN
Jeff    -5.0
Ryan     4.0
dtype: float64

### Identifying missing data

In [17]:
pd.isnull(obj2)

Bob      False
Steve     True
Jeff     False
Ryan     False
dtype: bool

In [18]:
pd.notnull(obj2)

Bob       True
Steve    False
Jeff      True
Ryan      True
dtype: bool

In [19]:
obj2.notnull()

Bob       True
Steve    False
Jeff      True
Ryan      True
dtype: bool

# Dictionary

* Has {'key': value, 'key': value, .. } pairs
* For example, when you want a telephone book which maps names to phone numbers: {'John Smith' : '555-1212'}

# DataFrame

* Represents a rectangular table of data and contains an ordered collection of columns
* Each column can be a different value type (numeric, string, boolean, etc.)
* DataFrame has both a row and column index
* Can be thought of as a dict of Series all sharing the same index

### Creating DataFrame from a dict of equal-length lists or NumPy arrays

In [21]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],        
        'year': [2000, 2001, 2002, 2001, 2002, 2003],        
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} 
frame = pd.DataFrame(data) 
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### Create frame2 with a custom index 
* If you pass a column that isn’t contained in the dict, it will appear with missing values in the result

In [93]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

### Modifying columns
* Columns can be modified by assignment. 
* For example, the empty 'debt' column could be assigned a scalar value or an array of values
* When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame

In [89]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

### Creating new column through assignment
* Assigning a column that doesn’t exist will create a new column

In [90]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Nevada  2.4   3.0    False
five   2002  Nevada  2.9   4.0    False
six    2003  Nevada  3.2   5.0    False

### Removing columns: del

In [91]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

### Removing rows: drop

In [92]:
frame2 = frame2.drop(['two', 'four'])
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
three  2002    Ohio  3.6   2.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

### Accessing rows from top or bottom as a DataFrame

In [34]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [35]:
frame.tail(2)

    state  year  pop
4  Nevada  2002  2.9
5  Nevada  2003  3.2

### Retrieving columns as series and arrays
* frame2[column] works for any column name, but frame2.column only works when the column name is a valid Python variable name

In [36]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [27]:
frame['state'].values

array(['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'], dtype=object)

In [43]:
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

### Retrieving rows as Series using loc and iloc attributes

In [96]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [97]:
frame2.loc['three', ['year', 'state']]

year     2002
state    Ohio
Name: three, dtype: object

In [100]:
frame2.iloc[2, [0, 1]]

year     2002
state    Ohio
Name: three, dtype: object

In [98]:
frame2.loc[['two', 'three'], ['year', 'state']]

       year state
two    2001  Ohio
three  2002  Ohio

In [101]:
frame2.iloc[[1, 2], [0, 1]]

       year state
two    2001  Ohio
three  2002  Ohio

### Retrieving DataFrame as a two-dimentional array

In [57]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### Transposing a DataFrame: swap rows and columns

In [46]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [48]:
frame2.T

        one   two three    four    five     six
year   2000  2001  2002    2001    2002    2003
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop     1.5   1.7   3.6     2.4     2.9     3.2
debt    NaN   NaN   NaN     NaN     NaN     NaN

### Creating DataFrame from nested dict of dicts (not to be covered, for self study)
* If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices
* The keys in the inner dicts are combined and sorted to form the index in the result

In [53]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} 
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

* If a DataFrame’s index and columns have their name attributes set, these will also be displayed

In [56]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

## Thank you!